// 问题描述
// 社团活动结束后，小蓝负责为参加活动的 N 名同学拍摄合影，其中第 i 名同学的身高为 Hᵢ 厘米。
// 小蓝准备让同学们站成一排。为了让画面更加协调，他希望参加同一张合影的同学身高较为接近，因此要求最高者与最矮者的身高差不能超过 K 厘米。
// 小蓝可以从这 N 名同学中任选一些人参加合影。请你帮助他计算，一张合影中最多可以安排多少名同学。

// 输入格式
// 第一行包含两个整数 N, K（1 ≤ N ≤ 10⁵，0 ≤ K ≤ 10⁹），分别表示同学人数和允许的最大身高差。
// 第二行包含 N 个整数 H₁, H₂, ..., H_N（1 ≤ Hᵢ ≤ 10⁹），表示每名同学的身高。

// 输出格式
// 输出一个整数，表示一张合影中最多可以安排的同学人数。

#include <iostream>
#include <algorithm>
using namespace std;

int main(){

    int N = 0, K = 0;
    cin >> N >> K;
    int H[N];
    for (int i = 0; i < N; i ++){
        cin >> H[i];
        // H[i] -= 165;
    }

    sort (H, H + N);                             //把身高从小到大排队
    // for (int i = 0; i < N; i ++) {
    //     cout << H[i] << " ";
    // }
    // cout << endl;

    int max = 0;                                         //记录最大人数(max)

    // for(int i = 0; i < N; i ++){                         //从第i个开始往后依次判断到差值最大时, 需要两层循环, 自己不需要再和自己判断
    //     int j = i + 1;
    //     for (; j < N; j ++){
    //         if (H[j] > H[i] + K){                        //如果超出范为就跳出循环，人数是j - i
    //             break;
    //         }
    //     }
    //     if (j - i > max){
    //         max = j - i;
    //     }
    // }

    //更简便的方法: 无需回退j
    int j = 0;                          // ① 右指针，全程只往右走

    for(int i = 0; i < N; i++){         // ② 左指针，每次往右移一格
        while(j < N && H[j] <= H[i] + K){  // ③ j 尽量往右探
            j++;
        }
        if (j - i > max){              // ④ 人数 = j - i
            max = j - i;
        }
    }   

    cout << max << endl;
    return 0;
}