// 问题描述
// 小蓝需要将 N 份材料从服务站分别送往 N 栋宿舍楼，每栋宿舍楼一份。其中，服务站到第 i 栋宿舍楼的最短路程为 Dᵢ 米，往返的路程相同。
// 为了运送材料，小蓝从服务站借来了一辆小推车。这辆小推车每次只能装一份材料，因此小蓝送完一份材料后，如果还有材料需要配送，就要回到服务站领取下一份。当全部材料配送完毕后，小蓝可以直接结束工作，不必再次返回服务站。
// 为了尽量减少行走路程，小蓝可以自行安排这 N 栋宿舍楼的配送顺序。现在，请你计算他完成全部配送至少需要行走多少米。
// 输入格式
// 第一行包含一个整数 N（1 ≤ N ≤ 10⁵），表示需要配送的材料数量。
// 第二行包含 N 个整数 D₁, D₂, ..., D_N（1 ≤ Dᵢ ≤ 10⁹），表示各宿舍楼到服务站的路程。
// 输出格式
// 输出一个整数，表示完成全部配送的最短路程。


#include <iostream>
#include <algorithm>
using namespace std;
int main() {
    // 请在此输入您的代码
    
    int N;
    cin >> N;
    long long D[N];
    for (int i = 0; i < N; i++) {
        cin >> D[i];
    }

    sort (D, D + N);                           //利用algorithm库中的sort函数对数组进行排序，默认从小到大排列
    long long sum = 0;
    for (int i = 0; i < N - 1; i++) {          //从小到大依次计算前 N-1 栋宿舍楼的路（贪心算法）
        sum += D[i] * 2;                       //前 N-1 栋宿舍楼需要往返，所以乘以 2
    }

    sum += D[N - 1];                           //最后一栋宿舍楼只需要单程，所以加上最后一栋宿舍楼的距离
    cout << sum << endl;
    return 0;
}