// 问题描述
// 校园文化节的晚会上，小蓝负责布置一条挂有 N 面彩旗的彩带。第 i 面彩旗的长度为 Aᵢ。
// 设计图要求，彩旗从左到右的长度不能变小。小蓝检查时发现，已经挂好的彩旗不一定符合要求，而且比挂架能够容纳的数量多了 K 面。
// 晚会即将开始，小蓝来不及重新排列所有彩旗。他准备拆下连续的 K 面彩旗，再把拆除处两侧剩余的彩带接起来，其余彩旗保持原来的相对顺序。
// 请计算，有多少种拆除位置，能够使剩余彩旗从左到右的长度不递减。如果拆下彩带开头或末尾的 K 面彩旗，直接保留另一部分即可。
// 两种选择只要拆下的起始位置不同，就视为不同的方案。


// 输入格式
// 第一行包含两个整数 N, K（2 ≤ N ≤ 10⁵，1 ≤ K < N），分别表示彩旗数量和需要拆下的数量。
// 第二行包含 N 个整数 A₁, A₂, ..., A_N（1 ≤ Aᵢ ≤ 10⁹），表示彩旗从左到右的长度。


// 输出格式
// 输出一个整数，表示满足设计要求的拆除方案数量

#include <iostream>
using namespace std;
int main()

{
    // 请在此输入您的代码
    int N = 0, K = 0;
    cin >> N >> K;
    int P[N];
    for (int i = 0; i < N; i ++){
        cin >> P[i];
    }


    int NewP[N - K];                             //数组元素的移除
    int Count = 0;                                           //计数器

    for(int m = 0; m < N - K; m ++){                         //从每一个位置 m 开始拆除K个彩旗，判断剩余的彩旗是否满足要求
                                                             //第m到第m+K-1个彩旗被拆除，剩余的彩旗为第0到第m-1个和第m+K到第N-1个
        for (int i = 0; i <= N - K; i ++){                   //在不同位置m起始，前k个数组元素移除
            if (i < m){
                NewP[i] = P[i];
            }
            else{
                NewP[i] = P[i + K];
            }

                int ok = 1;
                for (int k = 1; k < N - K + 1; k ++){
                    if (NewP[k] < NewP[k - 1]){
                        ok = 0;
                        break;
                    }
                }
                if (ok){
                    Count ++;
                }
        }
    }
    cout << Count << endl;



    return 0;
}